[
  {
    "name": "Appetizers",
    "items": [
      {
        "name": "Garlic Fries",
        "desc": "House cut, skin on fries tossed in garlic sauce and served with a creamy, spcie red pepper aioli",
        "cost": 6
      },
      {
        "name": "Pizza Egg Rolls",
        "desc": "Mozzarella, pepperoni, and sausage served with a side of our house made pizza sauce",
        "cost": 7
      },
      {
        "name": "Bacontaters",
        "desc": "Brown sugar and cayenne pepper acanided bacon wrapped around classic America Tater Tots.  Served with spicy rasberry BBG sauce",
        "cost": 8
      },
      {
        "name": "Crab & Artichoke Dip",
        "desc": "Artichoke and spinach dip with lump crab served hot with celery, pita toast points, and grilled crostini",
        "cost": 12
      },
      {
        "name": "Onion Rings",
        "desc": "Thick cut, battered sweet onions deep-fried and served with our hickory maple BBG sauce",
        "cost": 7
      },
      {
        "name": "Beer & Pretzel Curds",
        "desc": "From Ellsworth, WI, these curds are battered and deep fried and served with a side of spicy mayo for dipping",
        "cost": 7
      },
      {
        "name": "Bacon & Bleu Fries",
        "desc": "Sweet potato waffle fries tossed inb garlic sauce then topped with bleu cheese, bacon, and scallions.  We serve them with a side of sriracha aioli for dipping",
        "cost": 9
      },
      {
        "name": "Quesadilla",
        "desc": "Marinated grilled chicken, BBQ, bacon, and fresh apple slices with melted cheddar cheese",
        "cost": 8
      },
      {
        "name": "Nachos",
        "desc": "Grilled BBQ chicken and sauteed kale topped with melted cheddar cheese and black bean corn salsa.  Served with salsa and sour cream",
        "cost": 10
      }
    ]
  },
  {
    "name": "Burgers",
    "desc": "Our gourmet burgers are made with fresh, <i>Certified Angus Beef&copyrt;</i> and are served on a fresh, grilled brioche bun with fries or tots.  Substitute garlic fries, sweet potato fries, onion rings, or Asian slaw for 1.50",
    "items": [
      {
        "name": "Walk of Shame",
        "desc": "Jalapeno jelly, peanut butter, bacon, and a fried egg",
        "cost": 9
      },
      {
        "name": "Steakhouse",
        "desc": "Caramelized onions, sauteed mushrooms and brown gravy",
        "cost": 9
      },
      {
        "name": "Blackened Bleu",
        "desc": "Cajun seasoned and topped with bleu cheese, caramelized onions and creole sauce",
        "cost": 9
      },
      {
        "name": "Burger Mi",
        "desc": "topped with seared pork belly, house made kimchi, sriracha aioli, and fresh cilantro",
        "cost": 9
      },
      {
        "name": "Sweaty Betty",
        "desc": "Habenero jack cheese, candied jalapenos, peppered bacon, and sriracha aioli",
        "cost": 10
      },
      {
        "name": "Poutine Burger",
        "desc": "Topped with house cut garlic fries, cheddar cheese, and brown gravy",
        "cost": 8
      },
      {
        "name": "Veggie Burger",
        "desc": "Our quinoa and roasted black bean burger is topped with sundried tomato pesto and shredded kale",
        "cost": 9
      },
      {
        "name": "Signature Betty",
        "desc": "Fresh apple slices, peppered bacon, caramelized onions, and Swiss cheese",
        "cost": 10
      },
      {
        "name": "Turkey Caprese",
        "desc": "Our all natural turkey patty is topped with fresh mozzaraella, tomato, basil, and balsamic glaze",
        "cost": 10
      },
      {
        "name": "BYO Burger",
        "desc": "Sub a veggie patty, turkey patty,or chicken breast for 1.  Lettuce, tomato, and onion free upon request. Add toppings for .75",
        "cost": 7
      }
    ]
  },
  {
    "name": "Salads",
    "items": [
      {
        "name": "Chicken BLT Salad",
        "desc": "Grilled chicken, bacon, tomato, and red pepper dressing over mixed greens",
        "cost": 10
      },
      {
        "name": "Southwest Salad",
        "desc": "House roasted pork shoulder, black bean corn salsa over mixed greens with cheddar cheese topped with ranch dressing and BBQ",
        "cost": 9
      },
      {
        "name": "Chicken Caesar Salad",
        "desc": "Grilled chicken, croutons, and shredded parmesan in Caesar dressing",
        "cost": 9
      },
      {
        "name": "Pork Belly Salad",
        "desc": "Seared pork belly over mixed greens with pickled vegetables, fried wontons, and sesame soy ginger dressing",
        "cost": 10
      }
    ]
  },
  {
    "name": "Flatbreads",
    "items": [
      {
        "name": "Pulled Pork",
        "desc": "House roasted pork shoulder, soy ginger marinade, fresh apple slices, and cabbage slaw tossed in spicy red pepper sesame sauce",
        "cost": 12
      },
      {
        "name": "Southwest Chicken",
        "desc": "Grilled adobo chicken, kale, black bean corn salsa, and cheddar cheese",
        "cost": 11
      },
      {
        "name": "Peach & Gorgonzola",
        "desc": "Fresh kale, toasted almonds, gorgonzola cheese, and drunken peaches topped with shaved white chocolate and a sweet and spicey honey chipotle vinaigrette",
        "cost": 12
      }
    ]
  },
  {
    "name": "Sandwiches",
    "items": [
      {
        "name": "Hickory Maple Pork",
        "desc": "Our house roasted pork shoulder, maple BBQ sauce, bacon, kale, and carmelized onions on grilled sourdough",
        "cost": 9
      },
      {
        "name": "PBLT",
        "desc": "A BLT on PEDs.  Seared pork belly, crispy bacon, lettuce, tomato, and spicy red pepper mayo",
        "cost": 10
      },
      {
        "name": "1987",
        "desc": "An American classic done Bug Eyed! Fried bologna, carmelized onions, dark ale whole grain mustard and American cheese on grilled sourdough bread",
        "cost": 8
      },
      {
        "name": "Brie Chicken Sandwich",
        "desc": "Grilled chicken, brie, fresh apples, carmelized onions, and spicy mayo on our handsome brioche bun",
        "cost": 10
      },
      {
        "name": "Fish Tacos",
        "desc": "Deep fried beer-battered mahi mahi, kale salad and spicy sriracha aioli on warm flour tortillas",
        "cost": 9
      },
      {
        "name": "Braised Beef Tacos",
        "desc": "Beer braised beef with a sesame ginger sauce, shredded vegetables, and red pepper mayo on flour tortillas",
        "cost": 9
      },
      {
        "name": "Buffalo Chicken Wrap",
        "desc": "Our marinated grilled chicken, buffalo sauce, jalapeño bacon cream cheese, lettuce, and black bean corn salsa wrapped in a flour tortilla",
        "cost": 9
      },
      {
        "name": "Half Moon Over Cuba",
        "desc": "Pulled pork, bacon,  dark ale mustard, homemade pickles, and Swiss cheese on a grilled baguette",
        "cost": 9
      },
      {
        "name": "Saloon Steak Sandwich",
        "desc": "Sauteed marinated steak, mushrooms and onions on a garlic-toasted baguette with melted Swiss cheese",
        "cost": 9
      },
      {
        "name": "Grilled Cheese",
        "desc": "Parmesan crusted sourdough bread, cheddar cheese, Swiss cheese, peppered bacon, drunken peaches and a chipotle-honey vinaigrette",
        "cost": 9
      }
    ]
  }
]